Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Please refer to the xref:redis-reference.adoc[Quarkus Redis Client reference] for information how to configure the Redis client.
ja_jp: Redis クライアントの設定方法については、xref:redis-reference.adoc[Quarkus Redis クライアントリファレンス] を参照してください。

source: Please remember these are not the same property names as the ones used in the Quarkus `{config-file}`, nor will the same defaults be applied.
ja_jp: これらは Quarkus の `{config-file}` で使用されるプロパティー名と同じではなく、同じデフォルト値が適用されるわけではありませんのでご注意ください。

source: Please report any security issues you find in Quarkus to:
ja_jp: Quarkusで見つけたセキュリティー問題を次の場所に報告してください:

source: Please save client id and secret displayed on the next page, you will need them later:
ja_jp: 次のページに表示されるクライアント ID とシークレットを保存してください。後で必要になります。

source: Please see <<access_id_and_access_tokens,Access ID and Access Tokens>> section below for more information.
ja_jp: 詳しくは下記の link:#access_id_and_access_tokens[アクセスID・アクセストークン] の項をご覧ください。

source: Please see also <<redis-reference.adoc#custom_redis_commands,How to use custom Redis Commands>>.
ja_jp: link:redis-reference.html#custom_redis_commands[Redisのカスタムコマンドの使い方]もご参照ください。

source: Please see below section <<hibernate-configuration-properties, Hibernate ORM configuration properties>> for the list of properties you can set in `{config-file}`.
ja_jp: `{config-file}` で設定できるプロパティのリストについては、以下の <<hibernate-configuration-properties, Hibernate ORM 設定プロパティ>> のセクションを参照してください。

source: Please see https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_overview[Keycloak Authorization Services documentation] for more information.
ja_jp: 詳しくは https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_overview[Keycloak認可サービスのドキュメント] を参照下さい。

source: Please see link:https://download.eclipse.org/microprofile/microprofile-jwt-auth-1.2/microprofile-jwt-auth-spec-1.2.html#_cdi_injection_requirements[MP JWT CDI Injection Requirements] for more details.
ja_jp: 詳細については、 link:https://download.eclipse.org/microprofile/microprofile-jwt-auth-1.2/microprofile-jwt-auth-spec-1.2.html#_cdi_injection_requirements[MP JWT CDI 注入要件] を参照してください。

source: Please see the Quarkus Native Reference Guide for more detailed information on these monitoring options.
ja_jp: これらの監視オプションの詳細は、Quarkus ネイティブリファレンスガイドを参照してください。

source: Please see the following links for further information on Cryostat:
ja_jp: Cryostatの詳細については、以下のリンクをご覧ください。

source: Please see the https://github.com/containers/podman/blob/main/docs/tutorials/podman-for-windows.md[Podman for Windows guide] for setup and usage instructions.
ja_jp: セットアップや使用方法については、 https://github.com/containers/podman/blob/main/docs/tutorials/podman-for-windows.md[Podman for Windows ガイド] を参照してください。

source: Please see the xref:security-ldap.adoc[Authenticate with LDAP] guide for more information about LDAP authentication mechanism.
ja_jp: LDAP 認証メカニズムの詳細については、xref:security-ldap.adoc[Authenticate with LDAP] ガイドを参照してください。

source: Please see the xref:security-oidc-bearer-token-authentication.adoc#mutual-tls-token-binding[Mutual TLS token binding] section for more information.
ja_jp: 詳細は xref:security-oidc-bearer-token-authentication.adoc#mutual-tls-token-binding[相互 TLS トークンバインディング] セクションを参照してください。

source: Please see the xref:security-openid-connect-client-reference.adoc#token-propagation-rest[Token Propagation] section about the Bearer access token propagation to the downstream services.
ja_jp: 下流サービスへのベアラアクセストークンの伝播については、xref:security-openid-connect-client-reference.adoc#token-propagation-rest[トークン伝播] の項を参照してください。

source: Please see the xref:security-openid-connect-client.adoc#token-propagation[Token Propagation] section about the Bearer access token propagation to the downstream services.
ja_jp: 下流サービスへのベアラアクセストークンの伝搬については、 xref:security-openid-connect-client.adoc#token-propagation[トークンの伝搬] の項を参照してください。

source: Please see xref:http-reference.adoc#same-site-cookie[SameSite cookies] for information about adding a https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie/SameSite[SameSite] cookie property to any of the cookies set by a Quarkus endpoint.
ja_jp: Quarkus エンドポイントによって設定されたクッキーに https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Set-Cookie/SameSite[SameSite] クッキープロパティーを追加する方法の詳細は、xref:http-reference.adoc#same-site-cookie[SameSite cookies] を参照してください。

source: Please see xref:native-and-ssl.adoc#working-with-containers[our Using SSL With Native Executables guide] for more information.
ja_jp: 詳しくは xref:native-and-ssl.adoc#working-with-containers[ネイティブ実行可能ファイルでのSSL利用ガイド] を参照してください。

source: Please see xref:security-built-in-authentication.adoc#mutual-tls[Mutual TLS Authentication] for more information.
ja_jp: 詳しくは link:security-built-in-authentication#mutual-tls[相互TLS認証] をご覧ください。

source: Please see xref:security-openid-connect-client-reference.adoc#token-propagation[Token Propagation] section about the Authorization Code Flow access token propagation to the downstream services.
ja_jp: 下流サービスへの認可コードフローアクセストークンの伝播については、xref:security-openid-connect-client-reference.adoc#token-propagation[トークンの伝播] の項を参照してください。

source: Please see xref:security-openid-connect-client-reference.adoc#token-propagation[Token Propagation] section about the Bearer access token propagation to the downstream services.
ja_jp: 下流サービスへのベアラアクセストークンの伝播については、xref:security-openid-connect-client-reference.adoc#token-propagation[トークン伝播] の項を参照してください。

source: Please see xref:security-openid-connect-client.adoc#token-propagation[Token Propagation] section about the Authorization Code Flow access token propagation to the downstream services.
ja_jp: 認可コードフローのアクセストークンの下流サービスへの伝搬については、 xref:security-openid-connect-client.adoc#token-propagation[トークンの伝搬] の項を参照してください。

source: Please see xref:security-openid-connect-client.adoc#token-propagation[Token Propagation] section about the Bearer access token propagation to the downstream services.
ja_jp: 下流サービスへのベアラアクセストークンの伝播については、xref:security-openid-connect-client.adoc#token-propagation[トークン伝播] の項を参照してください。

source: Please see xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] for more information about the way it is initialized and configured.
ja_jp: 初期化および設定方法の詳細については、xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] を参照してください。

source: Please see xref:security-openid-connect.adoc#integration-testing-security-annotation[Use TestingSecurity with injected JsonWebToken] section for more information about using `@TestSecurity` and `@OidcSecurity` annotations for testing the `web-app` application endpoint code which depends on the injected ID and access `JsonWebToken` as well as `UserInfo` and `OidcConfigurationMetadata`.
ja_jp: xref:security-openid-connect.adoc#integration-testing-security-annotation[注入された JsonWebToken とともに TestingSecurityを利用] セクションで、 `@TestSecurity` と `@OidcSecurity` アノテーションを使って `web-app` アプリケーションエンドポイントコードをテストする際の詳細な情報をご覧ください。このコードは注入した ID とアクセス `JsonWebToken`、さらに `UserInfo` と `OidcConfigurationMetadata` にも依存しています。

source: Please see xref:security-openid-connect.adoc#jwt-claim-verification[JSON Web Token Claim verification] section about the claim verification, including the `iss` (issuer) claim. It applies to ID tokens but also to access tokens in a JWT format if the `web-app` application has requested the access token verification.
ja_jp: `iss` (発行者) クレームを含むクレーム検証については、 xref:security-openid-connect.adoc#jwt-claim-verificationJSONWeb[トークンクレーム検証] セクションを参照してください。これは ID トークンに適用されますが、 `web-app` アプリケーションがアクセストークンの検証を要求した場合は JWT 形式のアクセストークンにも適用されます。

source: Please see xref:security-openid-connect.adoc#token-introspection-userinfo-cache[Token Introspection and UserInfo cache] for more information about using a default token cache or registering a custom cache implementation.
ja_jp: デフォルトのトークンキャッシュの使用またはカスタムキャッシュ実装の登録の詳細については、xref:security-openid-connect.adoc#token-introspection-userinfo-cache[Token Introspection および UserInfo キャッシュ] を参照してください。

source: Please see xref:security-openid-connect.adoc#token-verification-introspection[Token Verification And Introspection] for details about how the tokens are verified and introspected.
ja_jp: トークンの検証とイントロスペクトの方法の詳細については、 xref:security-openid-connect.adoc#token-verification-introspection[トークンの検証とイントロスペクション] を参照してください。

source: Please see xref:security.adoc#identity-providers[Security Identity Providers] for more information.
ja_jp: 詳しくは xref:security.adoc#identity-providers[セキュリティ・アイデンティティ・プロバイダー] をご覧ください。

source: Please test your applications with our latest 2.0.0.CR3 and report back!
ja_jp: 最新の2.0.0.CR3でアプリケーションをテストして、報告してください。

source: Please, refer to the https://github.com/CycloneDX/cyclonedx-gradle-plugin[Gradle CycloneDX plugin] documentation for its configuration options. Here is a list of Quarkus dependency configurations that would be relevant for manifesting:
ja_jp: 設定オプションについては、 https://github.com/CycloneDX/cyclonedx-gradle-plugin[Gradle CycloneDX プラグイン] のドキュメントを参照してください。以下に、マニフェストの作成に関連する Quarkus 依存関係設定をリストしています:

source: Please, refer to the link:https://hibernate.org/reactive/documentation/1.0/reference/html_single/#getting-started[getting started documentation] to find out more about the release.
ja_jp: このリリースの詳細については、 link:https://hibernate.org/reactive/documentation/1.0/reference/html_single/#getting-started[入門ドキュメント]を参照してください。

source: Please, see section <<hr-configuration-properties, Hibernate Reactive configuration properties>> for the list of properties you can set in `{config-file}`.
ja_jp: `{config-file}` で設定できるプロパティのリストについては、<<hr-configuration-properties, Hibernate Reactive 設定プロパティ>> のセクションを参照してください。

source: Plugging in converters and entity listeners
ja_jp: コンバーターとエンティティーリスナーのプラグイン

source: Plugging in custom components
ja_jp: カスタムコンポーネントのプラグイン

source: Plugging in other custom components
ja_jp: その他のカスタムコンポーネントのプラグイン

source: Plugins executed via jbang
ja_jp: jbang 経由で実行されるプラグイン

source: Plugins executed via shell
ja_jp: シェル経由で実行されるプラグイン

source: Podcast
ja_jp: ポッドキャスト

source: Podman Options
ja_jp: Podman オプション

source: Podman is a daemonless and rootless container engine for developing, managing, and running OCI Containers on your Linux system or other OS.
ja_jp: Podmanは、Linuxシステムやその他のOS上でOCIコンテナを開発、管理、実行するためのデーモンレス、ルートレスコンテナエンジンです。

source: Podman is a daemonless container engine for developing, managing, and running Containers on Linux systems. Since the release of version 3, Podman allows the user to run a service emulating a Docker API provided on a Unix socket. This makes it possible for Testcontainers and Quarkus Dev Services to be utilized with Podman.
ja_jp: Podmanは、Linuxシステム上でコンテナを開発、管理、実行するためのデーモンレスのコンテナエンジンです。バージョン3のリリース以降、PodmanはUnixソケット上で提供されるDocker APIをエミュレートするサービスを実行できるようになりました。これにより、TestcontainersやQuarkus Dev ServicesをPodmanで利用することができるようになりました。

source: Podman is a daemonless container engine. Quarkus Dev Services and Testcontainers expect a running Docker daemon listening at a Unix socket. Since version 3, Podman can be configured to create a service listening at a Unix socket and this service can be used with Dev Services and Testcontainers.
ja_jp: Podmanは、デーモンレスのコンテナエンジンです。QuarkusのDev ServicesとTestcontainersは、Unixソケットで待ち受ける稼働中のDockerデーモンを期待しています。バージョン3以降では、Unixソケットをリッスンするサービスを作成するようにPodmanを設定することができ、このサービスをDev ServicesやTestcontainersで使用することができます。

source: Podman is an open-source, daemonless, and rootless container engine for developing, managing, and running OCI Containers on Linux, Windows and Mac.
ja_jp: Podmanは、Linux、Windows、Mac上でOCIコンテナを開発、管理、実行するための、オープンソース、デーモンレス、ルートレスコンテナエンジンです。

source: Podman is distributed with user-local systemd units on `apt` and `dnf` package managers configured to run a rootless Podman service. This means that the Podman process will be launched only with the privileges of the user you are logged in as, that the containers and configuration are stored in your home directory and that this service listens at `unix:///run/user/$\{UID\}/podman/podman.sock`. In most of the Linux distributions, you can enable this service with the following command:
ja_jp: Podmanは、ルートレスのPodmanサービスを実行するように構成された `apt` 、 `dnf` パッケージマネージャ上のユーザーローカルのsystemdユニットとともに配布されます。これは、ログインしているユーザーの権限でのみPodmanプロセスが起動し、コンテナと設定がホームディレクトリに保存され、このサービスが `unix:///run/user/${UID}/podman/podman.sock` をリッスンすることを意味します。ほとんどのLinuxディストリビューションでは、以下のコマンドでこのサービスを有効にすることができます。

source: Podman is now available to respond to the Java Docker client used in Testcontainers. Please note that the Quarkus Dev Services require that a `docker` command is available on `PATH`. The `podman-docker` package on Linux distributions provides a Docker CLI emulation layer for Podman.
ja_jp: Testcontainersで使用されているJava Dockerクライアントに対応したPodmanが利用可能になりました。なお、Quarkus Dev Servicesでは、 `docker` コマンドが `PATH` で利用可能であることが必要です。Linuxディストリビューションの `podman-docker` パッケージは、Podman用のDocker CLIエミュレーションレイヤーを提供しています。

source: Podman supports two modes of operation: rootful, in which case the container runs as root on the Linux host (or VM in the case of Mac/Windows), and rootless, where the container runs under a standard Unix user account. The latter offers significantly stronger security, but some containers are not capable of running under the increased restrictions. As an example, if a container creates new devices, loopback mount points, and performs other highly restricted operations, then they must be run as root. Note, that this is not to be confused with the USER value specified in Containerfile/Dockerfile, which refers to how processes inside the container perceive themselves. In rootless, processes running in a container with a USER of "root" will appear to each other as root, but due to pid namespacing, they will actually be running as a standard restricted user account on the host system.
ja_jp: Podmanは2つの動作モードをサポートしています：コンテナがLinuxホスト（Mac/Windowsの場合はVM）上でrootとして実行されるrootfulと、コンテナが標準的なUnixユーザーアカウントで実行されるrootlessです。後者は大幅に強力なセキュリティを提供しますが、一部のコンテナは、強化された制限の下で実行できません。例として、コンテナが新しいデバイスを作成したり、マウントポイントをループバックしたり、その他の高度に制限された操作を実行したりする場合は、rootとして実行する必要があります。これは、Containerfile/Dockerfile で指定される USER 値と混同しないように注意してください。ルートレスでは、USER が「root」であるコンテナ内で実行されているプロセスは、互いに root として表示されますが、pid ネームスペーシングにより、実際にはホストシステム上の標準的な制限付きユーザーアカウントとして実行されます。

source: Podman supports two modes of operation: rootful, in which case the container runs as root on the host system, and rootless, where the container runs under a standard Unix user account. On Linux, the REST API Unix socket is, by default, restricted to only allow the root user to access it. This prevents someone from using a container to achieve a privilege escalation on the system. While these restrictions can be softened to allow a special group instead of just root, the recommended approach is to use rootless Podman on Linux. To use rootless Podman, you need to set a `DOCKER_HOST` environment variable to point to the user-specific socket.
ja_jp: Podman は 2 つの操作モードをサポートしています。コンテナーがホストシステム上で root として動作するルートフルと、コンテナーが標準的な Unix ユーザーアカウントで動作するルートレスです。Linux では、REST API Unix ソケットは、デフォルトで root ユーザーしかアクセスできないように制限されています。これは、誰かがコンテナーを使ってシステム上で特権を昇格させることを防ぐためです。この制限を緩和して root だけでなく特別なグループを許可することもできますが、Linux でルートレス Podman を使用する方法が推奨されています。ルートレス Podman を使うには、DOCKER_HOST 環境変数を設定して、ユーザー専用のソケットを指すようにする必要があります。

source: Podman supports two modes of operation: rootful, in which case the container runs as root on the host system, and rootless, where the container runs under a standard Unix user account. On Linux, the REST API Unix socket is, by default, restricted to only allow the root user to access it. This prevents someone from using a container to achieve a privilege escalation on the system. While these restrictions can be softened to allow a special group instead of just root, the recommended approach is to use rootless Podman on Linux. To use rootless Podman, you need to set a `DOCKER_HOST` environment variable to point to the user-specific socket. In both cases, you need to start the REST API by enabling the Podman socket service through systemd.
ja_jp: Podman は 2 つの操作モードをサポートしています。コンテナーがホストシステム上で root として動作するルートフルと、コンテナーが標準的な Unix ユーザーアカウントで動作するルートレスです。Linux では、REST API の Unix ソケットは、デフォルトで root ユーザーしかアクセスできないように制限されています。これは、誰かがコンテナーを使ってシステム上で特権を昇格させることを防ぐためです。この制限を緩和して root だけでなく特別なグループを許可することもできますが、Linux でルートレス Podman を使用する方法が推奨されています。ルートレス Podman を使うには、DOCKER_HOST 環境変数を設定して、ユーザー専用のソケットを指すようにする必要があります。いずれの場合も、systemd を通じて Podman ソケットサービスを有効にし、REST API を起動する必要があります。

source: Podman's install approach varies depending on the operating system you are using, and the required steps also change over time depending on the version of Podman. For Mac and Windows we highly recommend installing through the Podman Desktop graphical application. It is the simplest option with the least number of steps, it adds additional functionality like automatic start, and it helps manage future updates. There is also a CLI-only option that may be used. However, this setup requires additional manual tasks to manage, update, and launch the Podman Machine environment.
ja_jp: Podmanのインストール方法はお使いのオペレーティングシステムによって異なり、必要な手順もPodmanのバージョンによって変化します。MacとWindowsの場合は、Podman Desktopグラフィカルアプリケーションからのインストールを強くお勧めします。最もシンプルで手順が少なく、自動起動などの機能が追加され、将来のアップデートの管理にも役立ちます。CLIのみのオプションもあります。ただし、このセットアップでは、Podman Machine環境の管理、更新、起動に手動タスクが追加されます。

source: Podman's support for Ryuk container is currently flaky. Ryuk is a container that Testcontainers uses to clean up any containers spawned by Testcontainers after the end of their usage in Java code. You can configure Testcontainers not to use Ryuk.
ja_jp: PodmanのRyukコンテナのサポートは現在、不安定です。Ryukは、TestcontainersがJavaコードでの使用終了後に、Testcontainersによって生成されたコンテナをクリーンアップするために使用するコンテナです。Ryukを使用しないようにTestcontainersを設定することができます。

source: Point `ApiEchoServiceClient` to the `ApiEchoService` endpoint. HTTP port in the `org.acme.ApiEchoServiceClient/mp-rest/url=http://localhost:${port}` property is parameterized to ensure the correct URL is built while using the dev, test and prod modes.
ja_jp: `ApiEchoServiceClient` が `ApiEchoService` エンドポイントを指すようにします。 `org.acme.ApiEchoServiceClient/mp-rest/url=http://localhost:${port}` プロパティーは、開発モード、テストモード、本番モードの使用中に正しい URL が構築されるようにパラメーター化されます。

source: Point to the custom roles claim. The path to the roles claim is in double quotes because the claim is namespace qualified.
ja_jp: カスタムロールクレームを指します。クレームは namespace で修飾されているため、ロールクレームへのパスは二重引用符で囲まれます。

source: Point to the top-level project directory for the tests
ja_jp: テスト用のトップレベルのプロジェクト・ディレクトリを指定

source: Point your browser to `http://localhost:8080/fruits.html`;
ja_jp: ブラウザーで `http://localhost:8080/fruits.html` を指定します。

source: Point your browser to `http://localhost:8080/reactive-fruits.html`;
ja_jp: ブラウザーで `http://localhost:8080/reactive-fruits.html` を指定します。

source: Points to the corresponding extension deployment artifact in the `groupId:artifactId[:classifier:type]:version` format
ja_jp: `groupId:artifactId[:classifier:type]:version` フォーマットで、対応するエクステンションデプロイメントアーティファクトを指します。

source: Polaris implements the Iceberg REST API using Quarkus REST, leveraging the Quarkus Reactive Core and SmallRye Mutiny to process thousands of concurrent metadata requests asynchronously without blocking threads.
ja_jp: Polaris は、Quarkus REST を使用して Iceberg REST API を実装し、Quarkus Reactive Core と SmallRye Mutiny を活用して、何千もの同時メタデータリクエストをスレッドをブロックすることなく非同期で処理します。

source: Polaris leverages Quarkus Micrometer with Prometheus registry and Quarkus OpenTelemetry for complete observability. The catalog automatically tracks:
ja_jp: Polaris は、完全な可観測性のために、Prometheus レジストリを備えた Quarkus Micrometer と Quarkus OpenTelemetry を活用します。カタログは自動的に以下を追跡します。

source: Polaris supports multiple persistence backends (PostgreSQL via the Quarkus JDBC PostgreSQL extension, MongoDB via the Quarkus MongoDB Client extension, and in-memory for testing) using Quarkus's CDI qualifier mechanism:
ja_jp: Polaris は、Quarkus の CDI 修飾子メカニズムを使用して、複数の永続化バックエンド (Quarkus JDBC PostgreSQL エクステンションを介した PostgreSQL、Quarkus MongoDB Client エクステンションを介した MongoDB、およびテスト用のインメモリ) をサポートします。

source: Policy jars can also be located in the file system. <2> The policies jar is mapped to the `/opt/keycloak/providers/policies.jar` container location.
ja_jp: ポリシー jar はファイルシステム内に配置することもできます。 <2> ポリシー jar は、`/opt/keycloak/providers/policies.jar` コンテナーの場所にマップされます。

source: Pool class name
ja_jp: プールクラス名

source: Pool creator class name
ja_jp: プール作成者クラス名

source: Pool your database connections (included in Hibernate ORM)
ja_jp: データベース接続をプールする (Hibernate ORM に含まれる)

source: Pooled Connection `idle-timeout`
ja_jp: プールされた接続 `idle-timeout`

source: Pooled Connection `max-lifetime`
ja_jp: プールされた接続 `max-lifetime`

source: Pooled connection `idle-timeout`
ja_jp: プールされた接続 `idle-timeout`

source: Pooling Mechanism
ja_jp: プーリングメカニズム

source: Populating a `CaffeineCache`
ja_jp: `CaffeineCache` にデータを追加する

source: Port 80
ja_jp: ポート 80

source: Portable Extensions are not supported
ja_jp: ポータブルエクステンションはサポートされていません。

source: Português&nbsp;(Brasileiro)
ja_jp: ポルトガル語 &nbsp;(ブラジル)

source: Possibly a simpler alternative is to inject both `@IdToken JsonWebToken` and `UserInfo` and use `JsonWebToken` when dealing with the providers returning `IdToken` and `UserInfo` - with the providers which do not return `IdToken`.
ja_jp: よりシンプルな方法としては、 `@IdToken JsonWebToken` と `UserInfo` の両方をインジェクトして、 `IdToken` と `UserInfo` を返すプロバイダーを扱うときには `JsonWebToken` を使用します。 `IdToken` を返さないプロバイダーでは、 `UserInfo` を使用します。

source: Possibly a simpler alternative is to inject both `@IdToken JsonWebToken` and `UserInfo` and use `JsonWebToken` when handling the providers that return `IdToken` and use `UserInfo` with the providers that do not return `IdToken`.
ja_jp: おそらく、より簡単な代替案は、 `@IdToken JsonWebToken` と `UserInfo` の両方を注入し、 `IdToken` を返すプロバイダーを処理する際は `JsonWebToken` を使用して、 `IdToken` を返さないプロバイダーの場合は `UserInfo` を使用することです。

source: Post logout path
ja_jp: ログアウト後パス

source: Post logout uri param
ja_jp: ログアウト後 URI パラメーター

source: Post-update, if expected updates are missing, consider the following reasons:
ja_jp: 更新後、期待された更新がない場合は、以下の理由を検討して下さい：

source: PostgreSQL (container)
ja_jp: PostgreSQL (コンテナー)

source: PostgreSQL Client
ja_jp: PostgreSQLクライアント

source: PostgreSQL database connector
ja_jp: PostgreSQL データベースコネクター

source: PostgreSQL domain socket paths have the following form: `<directory>/.s.PGSQL.<port>`
ja_jp: PostgreSQL ドメインソケットパスの形式は、 `<directory>/.s.PGSQL.<port>` のようになります。

source: PostgreSQL only runs as a server, as do the rest of the databases below. As such, you must specify connection details, or use the defaults.
ja_jp: PostgreSQL は、以下の他のデータベースと同様に、サーバーとしてのみ動作します。そのため、接続の詳細を指定するか、デフォルトを使用する必要があります。

source: PostgreSQL: `postgresql`, `pgsql` or `pg`
ja_jp: PostgreSQL: `postgresql`、 `pgsql`、または `pg`

source: PostgresSQL domain socket paths have the following form: `<directory>/.s.PGSQL.<port>`
ja_jp: PostgresSQLドメインソケットパスは、次の形式をとります： `<directory>/.s.PGSQL.<port>`

source: Potential support for custom class loaders, which would allow us to return to the more optimized `fast-jar` packaging.
ja_jp: カスタムクラスローダーの潜在的なサポートにより、より最適化された `fast-jar` パッケージングに戻れるようになります。

source: Potentially increased size or complexity for automatically generated API clients
ja_jp: 自動生成された API クライアントのサイズや複雑さが増大する可能性がある

source: Pre-emptively fetching Quarkus data in the Quarkus project wizard, in order to avoid waiting after clicking on the `Next` button.
ja_jp: QuarkusプロジェクトウィザードでQuarkusデータを事前に取得することで、 `Next` ボタンをクリックした後の待ち時間を回避できます。

source: Precedence
ja_jp: 優先度

source: Precedence (higher wins)
ja_jp: 優先順位 (大優先)

source: Precedence rules can be overridden by parentheses.
ja_jp: 優先順位の規則は、カッコで上書きすることができます。

source: Precomputed percentile values can not. Percentiles are unique to each dataset (the 90th percentile of this collection of measurements).
ja_jp: 事前計算されたパーセンタイル値は再集計できません。パーセンタイルはデータセットごとに一意です (この測定値のコレクションの 90 パーセンタイルなど)。

source: Preconditions
ja_jp: 前提条件
